src/HeartFountain/case/constant/positionsFile

FoamFile
{
    version     2.0;
    format      ascii;
    class       Tuple2VectorVector;
    object      positions;
}
127
(
((0.05000189019410757 0.05504927899697347 0.005) (-0.44691817819608914 0.025722146904694727 0.8942049614917723))
((0.05001506697493688 0.05519571484074671 0.005) (-0.44646620418041655 0.05155959601537118 0.8933137951377794))
((0.05005054531974321 0.05543514475233168 0.005) (-0.44570290613320557 0.07761864664983086 0.8918095453383889))
((0.05011880293211513 0.055760764976893924 0.005) (-0.4446141571298552 0.10398677005866586 0.8896656691884174))
((0.050229526339451096 0.056163327486057776 0.005) (-0.4431821308790314 0.13072121746020396 0.8868492330578197))
((0.050391374313602605 0.056631406302313614 0.005) (-0.4413876581831831 0.15783551501384024 0.883326035733059))
((0.050611763800705555 0.05715172477016302 0.005) (-0.4392137690525703 0.18528370078921305 0.8790683791927046))
((0.05089668305833593 0.057709533151983815 0.005) (-0.43665062929028137 0.21294287238776685 0.8740661079344334))
((0.05125053610838521 0.058289024351996135 0.005) (-0.4337018089685671 0.2405957340620961 0.8683411965630293))
((0.051676021935223186 0.05887377442313657 0.005) (-0.4303911856336292 0.2679163505342787 0.8619653452693284))
((0.05217405110549797 0.059447193827547984 0.005) (-0.42676856489302323 0.29446398717766165 0.8550786819203149))
((0.052743701674622306 0.059992975223326445 0.005) (-0.4229099040036666 0.3196911606043591 0.8479061120944036))
((0.05338221539317712 0.06049552384206306 0.005) (-0.4189036500989542 0.34297208911251026 0.84076743396945))
((0.05408503435257033 0.06094035728979823 0.005) (-0.4148028317985562 0.36365676271500197 0.8340817523861456))
((0.054845877332241645 0.06131446281735477 0.005) (-0.4104756233035656 0.3811592120351391 0.8283884461738352))
((0.055656854249492384 0.06160660171779822 0.005) (-0.4050274207757892 0.39513189514992053 0.8245141441206112))
((0.05650861628628978 0.061807552458023565 0.005) (-0.3932213799161561 0.40619015451260104 0.8248554447622102))
((0.05739053849304886 0.06191028636541603 0.005) (-0.30920712052926885 0.42472554961031583 0.8508814042639629))
((0.058290930964198864 0.06191007208734253 0.005) (0.3112870294526115 0.42441995286944867 0.8502753018292746))
((0.059197274059566034 0.06180450753307329 0.005) (0.394269574218293 0.40603749031548636 0.824430142161255))
((0.060096472622693596 0.06159348050407182 0.005) (0.4056507239479606 0.39520503722522715 0.8241725964337218))
((0.060975123733498504 0.06127906162954547 0.005) (0.41089191604436276 0.381404189745539 0.8280692467263479))
((0.06181979223709438 0.060865335463817116 0.005) (0.41516258829162844 0.36368540948883316 0.8338902494980593))
((0.0626172881195958 0.06035817759170148 0.005) (0.4194022682107147 0.34179836285163095 0.8409967993825259))
((0.06335493975896914 0.059764987258896965 0.005) (0.42380827243992175 0.31551422683989944 0.8490213901151782))
((0.06402085716544109 0.059094386340181125 0.005) (0.4283635390404943 0.28453820942205443 0.857637852359371))
((0.06460417953975436 0.058355896337158646 0.005) (0.4329475307989912 0.24854964016026931 0.8664753383399075))
((0.06509530181404895 0.05755960553361876 0.005) (0.437356719120448 0.2073222146746766 0.8750637688434969))
((0.06548607529207115 0.05671583842113877 0.005) (0.441309782717212 0.16091688776642915 0.8828088303305838))
((0.0657699780629952 0.055834839048298085 0.005) (0.444471283689704 0.10991570416867502 0.8890240806369256))
((0.0659422515143212 0.054926479068124916 0.005) (0.44651368687851956 0.05560881535870563 0.893047135981384))
((0.066 0.054000000000000006 0.005) (0.4472135954999579 6.918046714916243e-17 0.8944271909999159))
((0.0659422515143212 0.0530637976377906 0.005) (0.44654245955928495 -0.05446739417065587 0.8931030930318193))
((0.0657699780629952 0.05212525469071166 0.005) (0.4446947755635078 -0.10540855868253485 0.8894580329295992))
((0.06548607529207115 0.05119062571157824 0.005) (0.44202855131411467 -0.1509976196057831 0.884200474268439))
((0.06509530181404895 0.05026497622912102 0.005) (0.438952640974316 -0.19023877619497184 0.8781399586703207))
((0.06460417953975436 0.04935217584028571 0.005) (0.43582429125029254 -0.2229394078755596 0.8719834904241449))
((0.06402085716544109 0.048454942918114155 0.005) (0.43289664347739265 -0.24948715658868595 0.8662312940337007))
((0.06335493975896914 0.04757493663069816 0.005) (0.43031541691837566 -0.27058155726597755 0.861170286778337))
((0.0626172881195958 0.046712890220164 0.005) (0.42814269729495347 -0.28701843863823945 0.8569213771605123))
((0.061819792237094384 0.04586877802185161 0.005) (0.42638692575705944 -0.2995555114656161 0.8534990832414625))
((0.060975123733498504 0.04504200756538074 0.005) (0.4250279427122137 -0.30884655892449786 0.8508613582448786))
((0.060096472622693596 0.04423162733022737 0.005) (0.42403405672748024 -0.3154201432986991 0.8489436093973876))
((0.05919727405956604 0.04343654035295071 0.005) (0.4233721096285992 -0.31968215581377085 0.8476788165590132))
((0.058290930964198864 0.042655713909807186 0.005) (0.4230126090021723 -0.32192867623081406 0.8470078276175793))
((0.05739053849304886 0.04188837591976783 0.005) (0.4229317913265803 -0.3223616637965321 0.8468834970641603))
((0.056508616286289774 0.04113418950607851 0.005) (0.42311191897797634 -0.32110395865114033 0.8472712385991519))
((0.055656854249492384 0.040393398282201794 0.005) (0.4235405977500504 -0.31821231989420407 0.848147558815728))
((0.054845877332241645 0.0396669363401561 0.005) (0.4242095315846797 -0.31368838441137004 0.8494974224787802))
((0.05408503435257033 0.03895649855506307 0.005) (0.4251129003124357 -0.3074879832897993 0.8513108492908575))
((0.05338221539317712 0.03826456860999741 0.005) (0.42624542007253646 -0.2995295022283242 0.8535788886576561))
((0.052743701674622306 0.03759440401539575 0.005) (0.42760009430270257 -0.28970208299030337 0.8562890063894311))
((0.05217405110549798 0.03694997927023125 0.005) (0.4291656669061727 -0.27787450868740926 0.8594199135293008))
((0.051676021935223186 0.036335890111397595 0.005) (0.43092384023637825 -0.2639056116309497 0.8629359605820275))
((0.05125053610838521 0.03575722345039967 0.005) (0.4328464166880209 -0.24765696159250777 0.8667814078157811))
((0.05089668305833593 0.03521939903615072 0.005) (0.43489266022667433 -0.22900837551235567 0.8708751563950817))
((0.050611763800705555 0.03472799005217737 0.005) (0.4370073378217166 -0.20787635943334482 0.8751068539776813))
((0.050391374313602605 0.034288530709930765 0.005) (0.4391200524845703 -0.18423488168017382 0.8793355945702644))
((0.050229526339451096 0.033906319404419474 0.005) (0.4411465516612519 -0.15813687544096786 0.8833925789721999))
((0.05011880293211513 0.033586226135620116 0.005) (0.44299259589026707 -0.12973370187772187 0.8870889056816713))
((0.05005054531974321 0.033332512665741144 0.005) (0.4445606194869242 -0.09928878469795147 0.8902289552888099))
((0.05001506697493688 0.033148673290198424 0.005) (0.4457587903295127 -0.06718124416588774 0.8926285796882671))
((0.05000189019410757 0.033037303175498106 0.005) (0.44651129278034934 -0.03389612789272115 0.8941357379802586))
((0.05 0.033 0.005) (0.4467679790691316 -8.482297455555424e-17 0.894649860492072))
((0.049998109805892435 0.033037303175498106 0.005) (-0.44651129278034934 -0.033896127892720986 0.8941357379802586))
((0.04998493302506313 0.033148673290198424 0.005) (-0.44575879032951266 -0.0671812441658876 0.8926285796882671))
((0.04994945468025679 0.033332512665741144 0.005) (-0.4445606194869243 -0.09928878469795134 0.89022895528881))
((0.04988119706788487 0.03358622613562012 0.005) (-0.44299259589026707 -0.12973370187772174 0.8870889056816713))
((0.04977047366054891 0.033906319404419474 0.005) (-0.4411465516612519 -0.1581368754409677 0.8833925789721999))
((0.0496086256863974 0.03428853070993076 0.005) (-0.43912005248457037 -0.18423488168017366 0.8793355945702644))
((0.04938823619929445 0.03472799005217736 0.005) (-0.4370073378217166 -0.2078763594333447 0.8751068539776813))
((0.049103316941664074 0.03521939903615072 0.005) (-0.4348926602266744 -0.2290083755123556 0.8708751563950817))
((0.048749463891614796 0.03575722345039967 0.005) (-0.4328464166880209 -0.24765696159250766 0.8667814078157811))
((0.04832397806477682 0.03633589011139759 0.005) (-0.43092384023637825 -0.26390561163094955 0.8629359605820275))
((0.047825948894502035 0.03694997927023124 0.005) (-0.4291656669061727 -0.2778745086874092 0.8594199135293008))
((0.0472562983253777 0.03759440401539575 0.005) (-0.4276000943027026 -0.28970208299030337 0.8562890063894311))
((0.046617784606822886 0.03826456860999741 0.005) (-0.4262454200725364 -0.2995295022283241 0.8535788886576561))
((0.04591496564742968 0.03895649855506307 0.005) (-0.42511290031243576 -0.30748798328979926 0.8513108492908577))
((0.04515412266775836 0.03966693634015609 0.005) (-0.42420953158467967 -0.3136883844113699 0.8494974224787802))
((0.04434314575050762 0.04039339828220179 0.005) (-0.42354059775005043 -0.31821231989420407 0.848147558815728))
((0.04349138371371023 0.0411341895060785 0.005) (-0.42311191897797634 -0.3211039586511403 0.8472712385991519))
((0.042609461506951156 0.04188837591976782 0.005) (-0.4229317913265803 -0.3223616637965321 0.8468834970641603))
((0.04170906903580114 0.042655713909807186 0.005) (-0.4230126090021723 -0.32192867623081406 0.8470078276175793))
((0.04080272594043397 0.043436540352950706 0.005) (-0.4233721096285992 -0.31968215581377085 0.8476788165590132))
((0.03990352737730641 0.04423162733022736 0.005) (-0.42403405672748024 -0.3154201432986991 0.8489436093973876))
((0.0390248762665015 0.04504200756538074 0.005) (-0.4250279427122137 -0.3088465589244978 0.8508613582448786))
((0.038180207762905635 0.045868778021851596 0.005) (-0.42638692575705944 -0.29955551146561626 0.8534990832414625))
((0.037382711880404214 0.04671289022016399 0.005) (-0.42814269729495347 -0.28701843863823967 0.8569213771605121))
((0.03664506024103086 0.04757493663069816 0.005) (-0.43031541691837566 -0.27058155726597755 0.861170286778337))
((0.035979142834558914 0.048454942918114155 0.005) (-0.43289664347739265 -0.24948715658868612 0.8662312940337007))
((0.03539582046024564 0.0493521758402857 0.005) (-0.43582429125029243 -0.2229394078755598 0.8719834904241449))
((0.03490469818595106 0.05026497622912101 0.005) (-0.43895264097431597 -0.1902387761949722 0.8781399586703206))
((0.03451392470792886 0.05119062571157822 0.005) (-0.4420285513141146 -0.15099761960578367 0.8842004742684388))
((0.034230021937004806 0.05212525469071166 0.005) (-0.4446947755635078 -0.10540855868253465 0.8894580329295992))
((0.03405774848567881 0.0530637976377906 0.005) (-0.44654245955928495 -0.054467394170655874 0.8931030930318196))
((0.034 0.054 0.005) (-0.4472135954999579 -2.075414014474873e-16 0.8944271909999159))
((0.03405774848567881 0.05492647906812491 0.005) (-0.44651368687851967 0.055608815358705106 0.8930471359813842))
((0.034230021937004806 0.05583483904829807 0.005) (-0.4444712836897041 0.1099157041686743 0.8890240806369258))
((0.03451392470792886 0.056715838421138774 0.005) (-0.441309782717212 0.1609168877664294 0.8828088303305838))
((0.03490469818595106 0.05755960553361876 0.005) (-0.437356719120448 0.20732221467467654 0.8750637688434969))
((0.03539582046024564 0.05835589633715864 0.005) (-0.4329475307989912 0.24854964016026918 0.8664753383399075))
((0.035979142834558914 0.05909438634018112 0.005) (-0.4283635390404943 0.2845382094220542 0.857637852359371))
((0.03664506024103086 0.05976498725889696 0.005) (-0.4238082724399218 0.31551422683989916 0.8490213901151782))
((0.03738271188040421 0.060358177591701485 0.005) (-0.4194022682107147 0.3417983628516311 0.8409967993825259))
((0.03818020776290563 0.060865335463817116 0.005) (-0.41516258829162844 0.3636854094888331 0.8338902494980593))
((0.0390248762665015 0.06127906162954547 0.005) (-0.41089191604436276 0.38140418974553897 0.8280692467263479))
((0.0399035273773064 0.06159348050407182 0.005) (-0.4056507239479606 0.3952050372252271 0.8241725964337218))
((0.040802725940433965 0.06180450753307329 0.005) (-0.3942695742182933 0.40603749031548625 0.824430142161255))
((0.041709069035801134 0.06191007208734253 0.005) (-0.3112870294526166 0.42441995286944784 0.8502753018292731))
((0.04260946150695115 0.06191028636541603 0.005) (0.3092071205292701 0.4247255496103156 0.8508814042639624))
((0.043491383713710224 0.061807552458023565 0.005) (0.393221379916156 0.40619015451260104 0.8248554447622102))
((0.044343145750507615 0.061606601717798214 0.005) (0.4050274207757892 0.39513189514992064 0.8245141441206112))
((0.045154122667758353 0.06131446281735477 0.005) (0.4104756233035655 0.38115921203513925 0.8283884461738352))
((0.04591496564742967 0.06094035728979823 0.005) (0.4148028317985561 0.36365676271500214 0.8340817523861455))
((0.046617784606822886 0.06049552384206306 0.005) (0.4189036500989542 0.34297208911251026 0.84076743396945))
((0.0472562983253777 0.059992975223326445 0.005) (0.4229099040036666 0.3196911606043592 0.8479061120944036))
((0.04782594889450203 0.059447193827548 0.005) (0.4267685648930231 0.2944639871776618 0.8550786819203149))
((0.04832397806477681 0.05887377442313657 0.005) (0.4303911856336291 0.26791635053427887 0.8619653452693283))
((0.04874946389161479 0.05828902435199614 0.005) (0.433701808968567 0.24059573406209642 0.8683411965630293))
((0.04910331694166407 0.05770953315198382 0.005) (0.43665062929028137 0.2129428723877672 0.8740661079344334))
((0.04938823619929445 0.05715172477016302 0.005) (0.4392137690525703 0.18528370078921305 0.8790683791927046))
((0.0496086256863974 0.056631406302313614 0.005) (0.4413876581831831 0.15783551501384033 0.883326035733059))
((0.04977047366054891 0.05616332748605778 0.005) (0.4431821308790314 0.1307212174602042 0.8868492330578197))
((0.04988119706788487 0.05576076497689393 0.005) (0.4446141571298552 0.10398677005866605 0.8896656691884174))
((0.04994945468025679 0.05543514475233168 0.005) (0.44570290613320546 0.07761864664983123 0.8918095453383886))
((0.04998493302506313 0.05519571484074671 0.005) (0.44646620418041655 0.051559596015371134 0.8933137951377794))
((0.049998109805892435 0.05504927899697347 0.005) (0.44691817819608914 0.025722146904694623 0.8942049614917723))
)
